# DSH_GetDSCount

## Description
Gets Data Sheets count for Object.

```pascal
FUNCTION DSH_GetDSCount(
				hObject      : HANDLE;
				VAR outCount : INTEGER): BOOLEAN;
```

```python
def vs.DSH_GetDSCount(hObject):
    return (BOOLEAN, outCount)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hObject|HANDLE|   |
|outCount|INTEGER|   |

## Version
Availability: from Vectorworks 2020.1

## Category
* Data Sheets